Tekla.Structures.Internal.PluginHelper
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.PluginHelper.StructuresPlugin
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.PluginHelper.Invoker
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.PluginHelper.InputThread
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.PluginHelper.GetHelper(Tekla.Structures.Internal.StructuresPluginDescriptor)
DO NOT USE! For internal usage only!
structuresPlugin:
Returns:

Tekla.Structures.Internal.PluginHelper.CreateInputThread
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.PluginHelper.StartInputThread
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.PluginHelper.GetInvoker
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.PluginHelper.Finish
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.PluginHelper.Cancel
DO NOT USE! For internal usage only!
Returns: